Дошкольное_учреждение83/src/Catalogs/удуМноготомники/удуМноготомники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуМноготомники</name>
  <attributes>
    <name>НаправлениеДеятельностиДОУ</name>
    <type>
      <types>CatalogRef.удуНаправленияДеятельностиДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТомов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.удуРолиАвтора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуОбозначенияМетодическихМатериалов/удуОбозначенияМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуОбозначенияМетодическихМатериалов</name>
  <enumValues>
    <name>Видеозапись</name>
  </enumValues>
  <enumValues>
    <name>Звукозапись</name>
  </enumValues>
  <enumValues>
    <name>Изоматериал</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Кинофильм</name>
  </enumValues>
  <enumValues>
    <name>Микроформа</name>
  </enumValues>
  <enumValues>
    <name>Мультимедиа</name>
  </enumValues>
  <enumValues>
    <name>Ноты</name>
  </enumValues>
  <enumValues>
    <name>Предмет</name>
  </enumValues>
  <enumValues>
    <name>Рукопись</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>ШрифтБрайля</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйРесурс</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуУчетныеЕдиницы/удуУчетныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуУчетныеЕдиницы</name>
  <basedOn>Catalog.удуМноготомники</basedOn>
  <basedOn>Catalog.удуСерии</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АвторПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.удуВидыМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многотомник</name>
    <type>
      <types>CatalogRef.удуМноготомники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиДОУ</name>
    <type>
      <types>CatalogRef.удуНаправленияДеятельностиДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НедоступенКВыдаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПерИздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОтносящиесяКЗаглавию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.удуСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>Учредитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.удуАвторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.удуРолиАвтора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образы</name>
    <attributes>
      <name>Образ</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Издательства</name>
    <attributes>
      <name>Издательство</name>
      <type>
        <types>CatalogRef.удуИздательства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоИздания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтандартногоНомера</name>
      <type>
        <types>EnumRef.удуВидыСтандартныхНомеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуМноготомники/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Тома.Параметры.УстановитьЗначениеПараметра("Многотомник",Объект.Ссылка);
	Тома.Параметры.УстановитьЗначениеПараметра("ПустаяСсылка",Справочники.удуМноготомники.ПустаяСсылка());
	Элементы.Тома.АвтоОбновление = Истина;
	Если Не ЭтоНовый() Тогда
		СформироватьПредставление();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Тома.Параметры.УстановитьЗначениеПараметра("Многотомник",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ЭтоНовый()
	Если Объект.Ссылка = Справочники.удуМноготомники.ПустаяСсылка() Тогда
	    Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции
	

&НаСервере
Процедура СформироватьПредставление()
	Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеМноготомника(ЭтаФорма);
	Если Объект.КоличествоТомов > 5 Тогда 
		Элементы.Представление.Высота = 7;	
	КонецЕсли;
	
КонецПроцедуры // СформироватьПредставление()

&НаКлиенте
Процедура ТомаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Представление = Представление;
КонецПроцедуры

&НаСервере
Процедура ДобавитьУчетнуюЕдиницуВМноготомник(Результат)
	Если ЗначениеЗаполнено(Результат) Тогда
		УчетнаяЕдиницаОбъект = Результат.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Результат.Многотомник) Тогда 
			УчетнаяЕдиницаОбъект.Многотомник = Объект.Ссылка;
			// Заполнить номер тома
			Запрос = Новый Запрос (
			 "ВЫБРАТЬ
			 |	удуУчетныеЕдиницы.Многотомник,
			 |	МАКСИМУМ(удуУчетныеЕдиницы.НомерТома) КАК НомерТома
			 |ИЗ
			 |	Справочник.удуУчетныеЕдиницы КАК удуУчетныеЕдиницы
			 |ГДЕ
			 |	удуУчетныеЕдиницы.Многотомник = &Многотомник
			 |
			 |СГРУППИРОВАТЬ ПО
			 |	удуУчетныеЕдиницы.Многотомник"
			);
			Запрос.УстановитьПараметр("Многотомник",Объект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			НомерТома = 1;
			Пока Выборка.Следующий() Цикл
				НомерТома = Выборка.НомерТома + 1;
			КонецЦикла;
			УчетнаяЕдиницаОбъект.НомерТома = НомерТома;	
			Если НомерТома > Объект.КоличествоТомов Тогда 
				Объект.КоличествоТомов = НомерТома;
			КонецЕсли;
			
			УчетнаяЕдиницаОбъект.Записать();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной учетной единицы многотомник уже указан");
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры // ДобавитьУчетнуюЕдиницуВМноготомник();

&НаСервере
Функция ПолучитьВидМатериала()
	Возврат Справочники.удуВидыМетодическихМатериалов.Книга;
КонецФункции // ПолучитьВидМатериала

&НаКлиенте
Процедура ДобавитьСуществующий(Команда)
	Если Не ЭтоНовый() Тогда
		ПараметрыВыбора = Новый Структура("ВидМатериала",ПолучитьВидМатериала());
		Результат = ОткрытьФормуМодально("Справочник.удуУчетныеЕдиницы.ФормаВыбора",ПараметрыВыбора);
		ДобавитьУчетнуюЕдиницуВМноготомник(Результат);
		Элементы.Тома.Обновить();
		СформироватьПредставление();
	Иначе 
		Ответ = Вопрос("Для добавления новых томов необходимо записать многотомник. Записать?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставление(Команда)
	СформироватьПредставление();
КонецПроцедуры
